{
    "scheduleArray": [
        {
            "sessionName": "KEYNOTE 1"
        },
        {
            "sessionName": "BREAKOUT 1",
            "selectedSession": {}
        },
        {
            "sessionName": "BREAKOUT 2",
            "selectedSession": {}
        },
        {
            "sessionName": "BREAKOUT 3",
            "selectedSession": {}
        },
        {
            "sessionName": "KEYNOTE 2",
            "selectedSession": {
                "id": "18625e9a-7c77-4c71-890c-40fc2591a7c3",
                "title": "QPR: Suicide Prevention Training",
                "demographic": "Suicide",
                "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
                "room": "Big Cottonwood",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Jeff Case",
                "speakerbio": "Although Jeff was born in upstate New York, he grew up all over the world as a military child. As an adult, he attended BYU earning degrees in Music and Psychology, spent eight years as a clinical psychologist in the Army, and currently provides counseling services to military veterans and their families. He has been married to his best friend Sarah for 21 years; they are the parents of three children and live in Utah County.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2017/03/15215338/Photo-Cropped-05.jpg"
            }
        },
        {
            "sessionName": "KEYNOTE 3"
        },
        {
            "sessionName": "BREAKOUT 4",
            "selectedSession": {}
        },
        {
            "sessionName": "BREAKOUT 5",
            "selectedSession": {}
        },
        {
            "sessionName": "BREAKOUT 6",
            "selectedSession": {}
        },
        {
            "sessionName": "KEYNOTE 4"
        }
    ],
    "timestamp": "2019-03-05T16:28:22.469Z",
    "schedule": {
        "friday": false,
        "saturday": false,
        "BREAKOUT 5": {},
        "BREAKOUT 3": {},
        "BREAKOUT 2": {},
        "BREAKOUT 4": {},
        "BREAKOUT 6": {},
        "BREAKOUT 1": {},
        "KEYNOTE 2": {
            "id": "18625e9a-7c77-4c71-890c-40fc2591a7c3",
            "title": "QPR: Suicide Prevention Training",
            "demographic": "Suicide",
            "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
            "room": "Big Cottonwood",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Jeff Case",
            "speakerbio": "Although Jeff was born in upstate New York, he grew up all over the world as a military child. As an adult, he attended BYU earning degrees in Music and Psychology, spent eight years as a clinical psychologist in the Army, and currently provides counseling services to military veterans and their families. He has been married to his best friend Sarah for 21 years; they are the parents of three children and live in Utah County.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2017/03/15215338/Photo-Cropped-05.jpg"
        }
    },
    "allSessions": {
        "effeedb5-3110-4093-a984-590f1cf9ff8f": {
            "id": "effeedb5-3110-4093-a984-590f1cf9ff8f",
            "sessiontype": "breakout 5",
            "title": "Panel: Healthy Ways to Communicate Your Needs in Marriage",
            "demographic": "Spouses",
            "description": "Lasting relationships require communication and flexibility. Working together to meet each other's needs is a dance that can create a meaningful and lasting relationship. Learning to communicate our needs in healthy ways can bring trust, safety, and connection to any marriage. On this panel, we will share experiences that have worked for us in our marriages.",
            "room": "Deer Valley",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Tera Brown",
            "speakerbio": "Tera’s healing journey began four years ago when she awoke from a lifelong pattern of avoiding and denying her emotions. Since then, she has staffed many support groups and experiential weekends. She has also co-led and presented at several conferences. She is a Certified Life Coach specializing in Neuro-Linguistic Programming. Tera and her husband Curtis have been married 22 years and have four children.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153802/Tera-Brown1.jpeg"
        },
        "6c6d4717-9420-46fa-b14f-ea41f4f0cd42": {
            "id": "6c6d4717-9420-46fa-b14f-ea41f4f0cd42",
            "sessiontype": "breakout 5",
            "title": "Increasing Self-Awareness: How to Respond to My Attractions in a Healthy Way?",
            "demographic": "SSA Men",
            "description": "Change is Inevitable. Growth is Optional. Have you ever wondered about the purposes of your same sex attraction? How have you been shaped or changed by your attractions to others? In this session, we will learn how to become aware of our attractions while identifying whether we are “acting on our attractions or taking action because of our attractions.” Attuning to our emotions by aligning our heart and mind unlocks our inner potential for self-actualization. Come learn how this gift might bless your life with unimaginable rewards when used in tandem with our Savior’s healing hands.",
            "room": "Sundance",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Pret Dahlgren",
            "speakerbio": "As a teen Preston moved to Utah with his family. He’s been married for 13 years; with four children and a fifth on the way. Stella, their \"Angel daughter,\" passed after birth. He works as a Director of Surgical Services for Intermountain Healthcare. He has a masters in Marriage and Family Therapy and practices as a LAMFT counselor specializing in helping individuals overcome obstacles that prevent them from determining their own path through life.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03154001/Pret-Dahlgren1.jpg"
        },
        "cb46c1f6-42c6-4e8b-85db-f37da6799019": {
            "id": "cb46c1f6-42c6-4e8b-85db-f37da6799019",
            "sessiontype": "breakout 5",
            "title": "The Dead-ends, U-turns, and Roadblocks of SSA Women's Journeys: Navigating Emotional and Spiritual Health",
            "demographic": "SSA Women",
            "description": "Every SSA woman’s journey is different, no two are the same. However, we can still learn from one another's dead-ends, u-turns, and roadblocks. In this session we will dig deep to uncover our own personal roadblocks and explore ways to find a road that fits us emotionally and spiritually.",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Brittany Ellis",
            "speakerbio": "Brittany lives in California with her husband and three kids. She became aware of her feelings of being gay at twelve years old and began her journey into figuring out how they fit into God's plan. Brittany found North Star when she was letting go of the shame that she had felt about being gay; embracing who she is and God’s love for her. Brittany found a sense of connection and belonging and loves being a part of this community.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153822/Brittany-Ellis.jpg"
        },
        "f1d1c808-7fcd-4776-96f9-88d287a0315c": {
            "id": "f1d1c808-7fcd-4776-96f9-88d287a0315c",
            "sessiontype": "breakout 5",
            "title": "Strengthening Your Marriage With Your Transgender Spouse",
            "demographic": "Trans",
            "description": "Every marriage has many unique nuances that can impact the ability to sustain peace and happiness. There is perhaps no more apparent example of this than in a marriage in which a spouse experiences gender variance. Regardless of the circumstances, marriages are most fulfilling when both partners have ownership over their own well-being and understand the role they play in the well-being of their spouse. In this session, we will discuss some of the unique challenges facing married couples grappling with issues surrounding gender and gender identity while striking a balance between sacrifice and self-fulfillment.",
            "room": "Snowbird",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Blaine Hickman",
            "speakerbio": "Blaine has worked as a therapist in Northern Utah for nine years as an Inpatient Therapist at McKay-Dee Hospital and at Aspire Counseling group until four years ago when he started his own practice where he works with individuals; both married and single, who experience issues surrounding sexual orientation, gender identity, internal conflict of religious beliefs, and sexual identity. Blaine has been married to Lindsay for 14 years and have three boys.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153841/Blaine-Hickman.jpg"
        },
        "f5904298-c7a0-497a-8c5d-c774ede0e362": {
            "id": "f5904298-c7a0-497a-8c5d-c774ede0e362",
            "sessiontype": "breakout 5",
            "title": "Ministering to LGBT Teens",
            "demographic": "Leadership",
            "description": "If a youth in your stewardship came out would you feel prepared to support them? This session will be filled with applicable ideas for how to help youth in your stewardship feel safe, loved, and supported regardless of what journey they are on. We invite you to join Diana Hoelscher in learning and understanding from real successes and failures. This class will identify doctrines that create powerful links between our LGBTQ+ teens and our Savior.",
            "room": "Wassatch",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Diana Hoelscher",
            "speakerbio": "Diana grew up in Madison, WI. She served in the Washington Tacoma Mission then taught at the MTC. As a published author, she has served in many callings in the church and has spoken in stakes for over 20 years. Diana resides in Spring, Texas with her family. She has a burning desire to share the gospel and the spiritual gift to bare her testimony to others.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153838/Diana-Hoelscher.jpg"
        },
        "63384374-c7b4-42b2-b541-6469d28e0cf7": {
            "id": "63384374-c7b4-42b2-b541-6469d28e0cf7",
            "sessiontype": "breakout 5",
            "title": "My Story: Finding Hope While Single",
            "demographic": "General",
            "description": "Is it possible to maintain hope while single and dealing with challenges of same-sex attraction? It can often be a lonely and challenging road, but a very possible one. Come hear the stories of three different individuals as they share their experiences of what has brought them hope and how they have been able to make the single life work for them.",
            "room": "Brighton / Alta",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Mark Buckley, Bryan Hill, and Kelly Quinn",
            "speakerbio": "Mark’s journey has been one of navigating growth and change. Originally from Wyoming, he currently lives in Modesto, owns an insurance agency, has three daughters, and was divorced after 29 years of marriage. He served a mission in Argentina and earned a degree in Family Financial Planning and Counseling from BYU. He is currently Ward Choir Director and Ward Historian/Newsletter Editor and also serves on the North Star Executive Committee as Vice President of Online Communities.\n\nBryan was born and raised in Clinton, Utah. After serving a mission in Oklahoma he graduated from USU with a bachelors in Marketing. Bryan began his journey fifteen years ago which led him to North Star. He has a deep love for the Savior and a strong testimony of the gospel. He currently serves as elders quorum president in his mid-singles ward. He loves spending time with family and friends and being active outdoors.\n\nAs a child, one of Quinn’s most vivid memories was being sealed to her parents in the Los Angeles Temple. As an adult, she moved to Utah for work. Four years ago, she discovered North Star when she was looking for a community to support her in her experiences with same-sex attraction. Quinn enjoys living in Utah, being an aunt, and leading an active lifestyle.",
            "speakerphoto": ""
        },
        "7b1e2f3d-d254-4994-b011-ffc83444fda2": {
            "id": "7b1e2f3d-d254-4994-b011-ffc83444fda2",
            "sessiontype": "breakout 3",
            "title": "QPR: Suicide Prevention Training",
            "demographic": "General",
            "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
            "room": "Big Cottonwood",
            "sessiontime": "1:30pm - 2:30pm",
            "speakername": "Debra and Don Coe",
            "speakerbio": null,
            "speakerphoto": null
        },
        "6ddf7c4b-6b68-4248-903b-ab5b68e73fe5": {
            "id": "6ddf7c4b-6b68-4248-903b-ab5b68e73fe5",
            "sessiontype": "breakout 3",
            "title": "Working Through Trauma in Marriage and Relationships: Balancing Compassion With Self-care",
            "demographic": "Spouses",
            "description": "As members of the LDS church we are taught the importance of forgiving and showing compassion to others and yet we also have emotional needs that cry out for attention. By focusing on self-care, establishing healthy boundaries, and holding space for our loved ones to heal from trauma, we are ensuring that both individuals have the opportunity to heal. This workshop will address how we can be angry and compassionate at the same time while maintaining composure in the face of intense pain and betrayal. Marianne will also map out the relationship between fear, anger, resentment, and the desire to control. She brings to this session a combination of both personal and professional experience in transforming trauma into personal strength.",
            "room": "Sundance",
            "sessiontime": "3:00pm - 4:00pm",
            "speakername": "Marianne Downing",
            "speakerbio": "Marianne was a therapist with LDS Family Services in 1986. In 2008 she moved to Paris and was called by the European Area Presidency to help establish LDS Family Services in French-speaking Europe. In 2012, she met her husband and moved to the US where she works as a consultant and coach. She is a mother of six and grandmother to eight with a masters degree in education, guidance, and counseling.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153814/Marianne-Downing.jpg"
        },
        "8f18fbea-3408-4bc8-9485-4a1e756a515e": {
            "id": "8f18fbea-3408-4bc8-9485-4a1e756a515e",
            "sessiontype": "breakout 3",
            "title": "Panel: Empowering Tools to Build My Community at Church and Amongst Peers",
            "demographic": "General",
            "description": "How do you talk with ward members about SSA or gender dysphoria? Are you coping with feelings of isolation within the church and LGBTQ+ community? In this session, we will be discussing tools to help build a safe community at church and how to better enlighten and support members who don't understand.",
            "room": "Deer Valley",
            "sessiontime": "3:00pm - 4:00pm",
            "speakername": "Courtney Ebmeyer",
            "speakerbio": "Courtney is excited to be facilitating a panel this year at the North Star Conference. Her passions in life are her five children; Brent, her husband of 15 years; and the gospel. Courtney is very driven and loves setting goals and going after them. She is grateful for the North Star community, for the resources she has received from it, and the support it gives to others. Courtney and Brent currently reside in Southern California.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153820/Courtney-Ebmeyer.jpg"
        },
        "b9c4e608-07ec-4d4f-984d-7d7489cc99b4": {
            "id": "b9c4e608-07ec-4d4f-984d-7d7489cc99b4",
            "sessiontype": "breakout 3",
            "title": "Understanding Healthy Male Relationships",
            "demographic": "SSA Men",
            "description": "Many men who are coming to terms with their sexual orientation share a history of difficulty connecting with other men in meaningful, healthy, and satisfying friendships. Even for men who have always had friendships with other men, being open about sexual orientation in these relationships can be scary and intimidating. In this session we will talk about some of the difficulties that exist in establishing fulfilling, platonic, healthy relationships within the SSA/Gay community and how to avoid frustrating patterns that often come when learning how to be vulnerable and open in friendships.",
            "room": "Brighton",
            "sessiontime": "3:00pm - 4:00pm",
            "speakername": "Blaine Hickman",
            "speakerbio": "Blaine has worked in Northern Utah for nine years as an Inpatient Therapist at McKay-Dee Hospital and at Aspire Counseling group until four years ago when he started his own practice where he helps both single and married individuals who experience issues surrounding sexual orientation, gender identity, internal conflict of religious beliefs, and sexual identity. Blaine has been married to Lindsay for 14 years and have three boys.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153841/Blaine-Hickman.jpg"
        },
        "dd40eae1-6d67-468e-8eb2-c6966fac9423": {
            "id": "dd40eae1-6d67-468e-8eb2-c6966fac9423",
            "sessiontype": "breakout 3",
            "title": "Panel: A House Divided: Navigating Family Dynamics",
            "demographic": "Family/Friends",
            "description": "Is SSA splitting your family apart? Does it cause contention between family members? Do you feel uncomfortable talking to your family members about their same-sex attraction? Do you feel that supporting your SSA son or daughter means that you are condoning their choices? In this panel we will discuss ways in which each member of the family can feel validated, loved, and accepted. We will discuss the difference between condoning and accepting and outline ways to facilitate a respectful and safe space for everyone to be able to express their feelings and opinions without creating an atmosphere of judgement and contention.",
            "room": "Snowbird",
            "sessiontime": "3:00pm - 4:00pm",
            "speakername": "Debby Jackson",
            "speakerbio": "Debby found North Star in 2013 after her youngest child came out as SSA. She then co-chaired the 2014/2015 conferences. A convert, return missionary, and BYU graduate; she works at BYU in the School of Communications. She enjoys an active life and visiting her eight grandchildren. She loves the Gospel and believes that our challenges strengthen us and increase our faith in Him; and it’s up to us to help each other make our way back to Him.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153829/Debby-Jackson.jpg"
        },
        "b2978cde-10db-450a-9967-cc381f826353": {
            "id": "b2978cde-10db-450a-9967-cc381f826353",
            "sessiontype": "breakout 3",
            "title": "Led By the Spirit: How I Felt My Way Back?",
            "demographic": "General",
            "description": "Figuring out how to make our lives work within the framework of the gospel while dealing with attractions to the same sex or challenges around gender identity can be a complex and daunting experience. Come listen and learn from the powerful testimonies of North Star Community members as they share their experiences with finding their way back to God and the gospel.",
            "room": "Wassatch",
            "sessiontime": "3:00pm - 4:00pm",
            "speakername": "Neil Petersen, Preston Jenkins, and Ann Pack",
            "speakerbio": "Recently returned to church activity, Neil is anxious to help others discover or rekindle what is missing from experiencing a fullness of life through his calling as a ward missionary. An obsessive interior designer, devoted dog-dad, doting uncle, and ever-improving disciple of Christ, Neil's life now feels fuller and richer. He has no doubt that the Savior can make more of us than we can make of ourselves.\n\nPreston was born and raised in Las Vegas. He served a mission in Tokyo but returned home early due to injury. After several years of struggling with his sexual identity and his spirituality, he chose to remain a member of the church and finished his mission in Atlanta. Preston's story was shared in Elder Holland's General Conference Address, \"Behold Thy Mother.\" He resides in Provo, attends BYU, and teaches at the MTC.\n\nAnn served a mission in London and married in the Bountiful Temple 19 years ago. After 15 years of marriage, she could no longer keep the secret that she was transgender. Instead of divorcing, they have chosen to stay together even though at times this has been extremely difficult for them. They live in Syracuse with their 14-year-old daughter and are passionate about bringing more understanding and awareness of LGBTQ+ members to the church.",
            "speakerphoto": null
        },
        "773d34b0-a6da-4d11-8ad2-73929a3406d3": {
            "id": "773d34b0-a6da-4d11-8ad2-73929a3406d3",
            "sessiontype": "breakout 3",
            "title": "Building and Keeping Healthy Relationships With Women (Closed door women's session)",
            "demographic": "SSA Women",
            "description": "In this session we will discuss what contributes to a healthy relationship and reverse ill-serving habits of co-dependency. We will also explore how to navigate relationships from a place of self-compassion, a balance of investments, setting healthy boundaries, and understanding what it takes to participate in constructive confrontations, i.e. “fighting fair.” Your stories and questions are a vital part of this conversation.",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "3:00pm - 4:00pm",
            "speakername": "Kara Posner",
            "speakerbio": "Kara has been practicing as a Licensed Clinical Mental Health Counselor in Salt Lake City for the past eight years. In her private practice she works with people from a broad range of faiths and enjoys learning from the various stories and experiences she hears. She is an active member of the LGBTQ+ Affirmative Therapists Guild of Utah and supervises students in the University of Utah CMHC program.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153930/Kara-Posner.png"
        },
        "24e6a0d8-9190-4a29-9ce4-0cdfccfce426": {
            "id": "24e6a0d8-9190-4a29-9ce4-0cdfccfce426",
            "sessiontype": "breakout 2",
            "title": "Finding Peace in My Sexuality as a Same-sex Attracted Woman",
            "demographic": "SSA Women",
            "description": "I am: Same-sex attracted. Gay. Lesbian. Bisexual. Pansexual. Or, whatever term you prefer. Labels have changed over the years and continue to do so. How can we find clarity with so many different perspectives regarding sexual orientation? Where can we turn for peace, especially with regards to our sexuality, attractions, identity, and faith? We’ll explore the possibilities and how we can apply them in our lives.",
            "room": "Sundance 100",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Laurie Campbell",
            "speakerbio": "Laurie is a Nationally Certified Counselor with a masters degree in counseling. As a 30 volunteer veteran, she has helped and supported fellow SSA/LGBTQ+ individuals. In 1994, she wrote and published Deseret Book’s first book on SSA entitled, “Born That Way?” using a pseudonym. Then in 2013, she wrote “Reborn that Way” under her married name. She has a video on the Mormon and Gay website.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153756/Laurie-Campbell1.jpg"
        },
        "1bbc2879-eb7d-4a21-bf6b-b921a60deed6": {
            "id": "1bbc2879-eb7d-4a21-bf6b-b921a60deed6",
            "sessiontype": "breakout 2",
            "title": "QPR: Suicide Prevention Training",
            "demographic": "General",
            "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
            "room": "Big Cottonwood",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Debra and Don Coe",
            "speakerbio": null,
            "speakerphoto": null
        },
        "924e642d-6a1b-4152-89ce-ca4352455ecb": {
            "id": "924e642d-6a1b-4152-89ce-ca4352455ecb",
            "sessiontype": "breakout 2",
            "title": "Panel: Pursuing Mixed-Orientation Relationships: What to Consider?",
            "demographic": "General",
            "description": "The big “M” word is a pretty big deal. How do I even know if it’s for me? What do I need to know for it to work? How can I develop the faith/hope/love necessary to succeed in this important relationship? Is it worth it? Bring your heartfelt questions and prayers to learn from couples who have asked similar questions and who are finding and applying beautiful answers and insights.",
            "room": "Deer Valley 150",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Vaughn Armstrong",
            "speakerbio": "A native Arizonian, Vaughn grew up in an active household with five other siblings. As a return missionary and graduate from BYU; Vaughn recognized his attractions to men while in college. His desire to live by faith and his own personal covenants set him on a difficult path of discovery which lead him to North Star. He’s grateful for the support, resources, personal growth, friendships, forgiveness, and miracles he’s experienced while on his journey.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2018/11/17174330/2019-NS-Bio-Pics-5.png"
        },
        "ec0eace8-cbb9-40f9-9d60-dabf08fb7d83": {
            "id": "ec0eace8-cbb9-40f9-9d60-dabf08fb7d83",
            "sessiontype": "breakout 2",
            "title": "Building the Trans Community: Coming Together Regardless of Our Differences",
            "demographic": "Trans",
            "description": "There is power in sharing our unique stories with each other. We all have our own road to travel and bonds are formed when we share our experiences while on our journey. In this breakout session, we will learn vital strategies that help us come together to strengthen those bonds.",
            "room": "Snowbird",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Ed Hayward",
            "speakerbio": "Born Methodist, Ed's parents joined the LDS church when he was about four years old. He grew up in Illinois but moved to Utah in 2001. Ed met his wife at BYU after a mission to Japan-Fukuoka. They then married and moved to Japan to be near her family. He's an entrepreneur and worked overseas for about 12 years. Ben and his wife have two children. He loves spending time with family, singing, camping, and hiking.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153952/Ed-Hayward.jpg"
        },
        "6eb143be-767b-408a-94ba-cb5817a7917f": {
            "id": "6eb143be-767b-408a-94ba-cb5817a7917f",
            "sessiontype": "breakout 2",
            "title": "Building Brotherhood",
            "demographic": "SSA Men",
            "description": "What are the core qualities of a great friendship? What are the characteristics of a lasting brotherhood of men that stick around for the long haul? In this interactive workshop we will look at elements that connect men at a heart-level and how to cultivate those qualities in our day-to-day connections.",
            "room": "Wassatch",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Tim Timmerman",
            "speakerbio": "Tim is a dedicated, truth-seeking, Christ-following individual who is passionate about writing, curating, and family. As a professional artist, 25-year veteran professor, and published author; Tim enjoys teaching young adults at George Fox University in Oregon. He published his book, \"A Bigger World Yet; Faith, Brotherhood, and Same-Sex Needs,\" in 2011. He continues to seek the Spirit’s influence in all aspects of his daily life.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2018/11/17163116/2019-NS-Bio-Pics-3.png"
        },
        "e055c445-7094-45e7-921b-2320774300db": {
            "id": "e055c445-7094-45e7-921b-2320774300db",
            "sessiontype": "breakout 2",
            "title": "Finding Hope in God: Principles for Thriving in Life and Fostering Self-Acceptance",
            "demographic": "General",
            "description": "When life doesn’t work out the way we planned it is natural to get discouraged. This session will discuss principles that allow us to have hope for the future, while also living in the here and now. Whether single, dating, or married we can experience peace and joy now in our lives.",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Ben Schilaty",
            "speakerbio": "Originally from Washington, Ben now lives in Provo and will be graduating from BYU in April with a masters in Social Work. In his spare time, he works as an intern at LDS Family Services. Fluent in both Spanish and Portuguese, Ben’s lived abroad in Mexico, Bolivia, Peru, and Portugal. He currently serves in his ward’s Sunday School presidency and as an ordinance worker in the Provo Temple.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153914/Ben-Schilaty.png"
        },
        "3bb402de-f669-4ecc-a0f5-90b6640ca3e3": {
            "id": "3bb402de-f669-4ecc-a0f5-90b6640ca3e3",
            "sessiontype": "breakout 2",
            "title": "Faith in Every Footstep: Stepping Into a New World of Family, Church and Friendships After Your Child Has Come Out",
            "demographic": "Family/Friends",
            "description": "After your child has come out it can be difficult to navigate your own emotions let alone relationships with family and friends. Strength, courage, testimony, and peace all bring new experiences and perspectives that are vital when interacting with our local and church community. Come discuss, listen, and share how powerful and beautiful it can be as you come out to others as the parent of an LGBTQ+ child. Remember to stand steadfast and look to God for the rest.",
            "room": "Brighton / Alta",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Rebecca Silva",
            "speakerbio": "Rebecca, her husband, and three children live in Central Florida. Homeschooled during her early years, she became a part-time professional photographer, earned her associates in graphic design, and became an ASL Interpreter. They became grandparents when her oldest daughter adopted a child. Their son came out as experiencing SSA five years ago. Their youngest daughter came out as pan-romantic and asexual a year and a half ago and recently become engaged to a transgender young man.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153928/Rebecca-Silva.jpg"
        },
        "918e4292-9e13-4253-a239-ddd86bc448f3": {
            "id": "918e4292-9e13-4253-a239-ddd86bc448f3",
            "sessiontype": "breakout 4",
            "title": "As I Am - Finding Myself Through Christ",
            "demographic": "SSA Men",
            "description": "There are many models of masculinity in the world today, but the ultimate example of masculinity was our Savior, Jesus Christ. Come partake in an experiential presentation for men about discovering and developing Christ-based masculinity.",
            "room": "Brighton / Alta",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Curtis Brown",
            "speakerbio": "Curtis has spent the last 10 years seeking healing in his own life. Through this journey, he became certified as a life coach and received training in various healing modalities for emotional and psychological healing. Curtis helped found a non-profit organization, Discover Identity, to help people learn about emotional intelligence, identity, and grief recovery. He has been married to his wife Tera for 25 years and have four children.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153806/Curtis-Brown.jpg"
        },
        "cfe7afde-de22-4a49-a859-97cce97091f6": {
            "id": "cfe7afde-de22-4a49-a859-97cce97091f6",
            "sessiontype": "breakout 4",
            "title": "How to Combat Depression and Anxiety While Staying Faithful?",
            "demographic": "General",
            "description": "We believe in a refining God. While this concept, in theory, may make sense to us; how can we remember to remain fixed while standing amidst our burning fire? How do we stay true to the promises, covenants, and hopes we have cultivated with our Father? How do we move past our mortal experiences and stand steadfast in our eternal progression?",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Taryn Dipo",
            "speakerbio": "Taryn was born and raised on a dairy farm in Draper, Utah. She and her husband of 13 years currently reside in Lehi, Utah where she is a stay at home mom. She loves serving in the immunocompromised intensive care unit at primary children’s hospital, has completed various humanitarian trips around the world, works with local refugees, and volunteers to stop child trafficking.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153811/Taryn-Dipo.jpeg"
        },
        "406b9dbd-5ae7-4b3e-bdcb-054af506a883": {
            "id": "406b9dbd-5ae7-4b3e-bdcb-054af506a883",
            "sessiontype": "breakout 4",
            "title": "Panel: How to Better Understand Your SSA/Gay or Trans Members in Your Congregation? (Returning Leader Attendees)",
            "demographic": "Leadership",
            "description": "Every leader wants everyone in their congregation to feel comfortable enough to worship at church on Sundays. They also want each individual to benefit from the community and friendship of a ward experience. Come listen to real life experiences where members who experience same-sex attraction have found peace and community among fellow Latter-day Saints largely due to the helpful fellowshipping tactics displayed by their local leaders. We invite you to bring questions and hope you leave feeling better prepared to love all members of your ward.",
            "room": "Deer Valley",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Kurt Francom",
            "speakerbio": "Kurt is the Executive Director and host of Leading Saints, a non-profit organization dedicated to helping LDS lay leaders be better prepared to lead. He enjoys drawing caricatures, playing basketball, reading, and watching college football. He served a mission in Sacramento, was an elder’s quorum president, executive secretary, bishopric counselor, bishop, and served in the stake presidency. He currently lives in Holladay, Utah with is his wife Alanna and two children.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153826/Kurt-Francom.jpg"
        },
        "11aeb34d-1dde-4766-8ad4-ea1c40720a2d": {
            "id": "11aeb34d-1dde-4766-8ad4-ea1c40720a2d",
            "sessiontype": "breakout 4",
            "title": "“And Jesus Beholding Him Loved Him”",
            "demographic": "Leadership",
            "description": "\"True ministering is accomplished one by one with love as the motivation,” as taught by President Jean B. Bingham in the April 2018 Conference. In the story of Jesus and the rich young man, Jesus loved him for all that he was doing that was good, allowed him agency, and loved him even when he made a different choice (Mark 10:17–22). While Jesus is the model for our gospel service, as mortals we must recognize that we differ from him in that we don't have all the answers and we frequently make mistakes as we strive to be good shepherds. As we seek to minister to all of our members, including and especially those in the LGBTQ+ community, we must seek to better understand, patiently love, and not take a one-size-fits all approach with counsel. We may not comprehend the struggles of others; all we can do is love and support them where they are in their journey.",
            "room": "Wassatch",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Eric Huntsman",
            "speakerbio": "BYU graduate, Eric earned his masters and doctorate in ancient history from the University of Pennsylvania. He has taught at BYU and BYU Jerusalem Center and was coordinator of the Ancient Near Eastern Studies Program in the Kennedy Center for International Studies. An avid published author, he has spoken at BYU Education Week, Women’s Conference, and TOFW. He’s a member of The Tabernacle Choir at Temple Square. He and his wife Elaine have two children.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153835/Eric-Huntsman.jpg"
        },
        "2c1c128e-b981-45bc-b208-c63605410a86": {
            "id": "2c1c128e-b981-45bc-b208-c63605410a86",
            "sessiontype": "breakout 4",
            "title": "Extreme Ownership: Empowering Your Marriage Through Understanding Boundaries",
            "demographic": "Spouses",
            "description": "Boundaries are not rules for someone else; they are a means of keeping you safe. When you understand healthy boundaries and the principle of extreme ownership you start to see what belongs to you and what belongs to others. This allows us to stop controlling and blaming as a means of discharging pain, permitting us to start living in a place of peace and wholeness. Find out how owning our feelings, thoughts, behaviors, and needs can lead to stronger more synergistic relationships with loved ones.",
            "room": "Snowbird",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Shelley Mangum",
            "speakerbio": "A lifetime of preparation has made Shelley a powerful and engaging presenter. She is not only a Licensed Clinical Mental Health Counselor in private practice, but also has taught Behavioral Health Education at UVU. She attends a women’s group; including spouses of SSA men. Her most cherished roles are that of mother and grandma. She loves seeking truth and helping facilitate positive change. She also loves adventures including hiking, biking, and camping.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153904/Shelley-Mangum.jpg"
        },
        "89da4ee8-061a-4153-bc11-06c241926c57": {
            "id": "89da4ee8-061a-4153-bc11-06c241926c57",
            "sessiontype": "breakout 4",
            "title": "“Living Two Worlds: Who I Was Expected to Be vs Who I Am.” (Viviendo entre dos mundos: Quien Esperaban Que Fuera vs Quien Soy\"",
            "demographic": "Spanish",
            "description": "Encontrar el balance entre quien deseas ser y la ideas que las personas que te aman expresan sobre el camino que has elegido, puede dificultar el descubrir quien realmente eres. La forma en que comunicamos nuestras expectativas puede en ocasiones sentirse como una carga para otros. Cómo podemos construir nuestra identidad y testimonio como Hijos de Dios? Cuál es la mejor manera de comunicarnos con aquellos que están en el proceso de encontrar a verdadero reflejo? Acompáñanos para descubrir la importancia de tu lugar en el Plan de Salvación.                                                                   Finding balance between who you want to be and the ideas that your loved ones express about the path you choose to follow can make it difficult to discover who you truly are. The way we communicate our expectations can sometimes feel like a burden to others. How can we build our identity and testimony as children of God? What is the best way to communicate with those that are in the process of finding their true reflection? Join us to discover the relevance of your place in the Plan of Salvation.",
            "room": "Big Cottonwood",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Livier Mendoza",
            "speakerbio": "Livier was born and raised in Mexico. After graduating from Law School, she served in the Mexico City Northwest Mission. Later she moved to Utah where she felt the need to talk to someone about her same gender attraction. She reached out to a mission companion who recommended North Star. Being an SSA woman is a blessing that has allowed her to grow closer to the Savior and to open her heart to serve others unconditionally.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153910/Livier-Mendoza.jpg"
        },
        "e0f87147-d862-4d1e-9113-99b44671908b": {
            "id": "e0f87147-d862-4d1e-9113-99b44671908b",
            "sessiontype": "breakout 4",
            "title": "Navigating Challenges of Faith",
            "demographic": "General",
            "description": "LGBTQ+ people of faith are faced with seemingly irreconcilable challenges and unanswerable questions on a daily basis. In this session we will take on these challenges and questions head-on. We will create a safe space to explore the very real challenges we face when our sexual/gender identities don't fit easily with our religious identities.",
            "room": "Sundance",
            "sessiontime": "10:30am - 12:00pm",
            "speakername": "Jana Spangler",
            "speakerbio": "Jana is a certified Integral Professional Coach whose work focuses on helping people affected by faith transition find balance and beauty in diversity and growth. The goal of her work is to strengthen self-determination, heal and strengthen relationships with others, and enable deep and lasting developmental growth in her clients. She lives in Holladay, Utah with her husband and three children, and is an active member of the LDS church.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153940/Jana-Spangler.jpg"
        },
        "c25360ce-ad64-430e-88ba-95d8c273cf90": {
            "id": "c25360ce-ad64-430e-88ba-95d8c273cf90",
            "sessiontype": "breakout 6",
            "title": "Having Hope in My Identity as a Child of God",
            "demographic": "General",
            "description": "Knowing who we truly are as children of God is one of the most hopeful and lasting truths in our lives; especially in a world that tries to get us to take on so many various identities. Come hear the stories of three North Star Community members as they share how they have been able to find hope and peace in more fully embracing their identities as children of God.",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Brent Ebmeyer",
            "speakerbio": "Brent has been a member of The Church of Jesus Christ of Latter-day Saints his whole life and served a mission in Argentina. He and Courtney married in 2004 and have five children. A year after they were sealed in the temple, Brent shared that he experiences same-sex attraction. It took them to the brink of separation; but through consistent communication, compassion, and love they have been able to find hope in their future together.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153817/Brent-Ebmeyer.jpg"
        },
        "8e478340-593e-4b96-9fef-7f7bc92b5a37": {
            "id": "8e478340-593e-4b96-9fef-7f7bc92b5a37",
            "sessiontype": "breakout 6",
            "title": "How to Maintain Open, Constructive and Vulnerable Conversations With Loved Ones?",
            "demographic": "Family/Friends",
            "description": "Discussing same sex attraction can become challenging when it triggers our fears. When we experience fear, we stifle our capacity to show up with love. Coach Kim will teach you how to manage your fears, access your love, and handle difficult conversations with ease. Don’t miss this class, as it can also improve your relationship skills in other areas of your life.",
            "room": "Wassatch",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Kim Giles",
            "speakerbio": "Kim is an International Human Behavior Expert, professional speaker, and author. She's best known for her KSL articles, books, and podcasts and has a unique way of making psychology, mental, emotional, and social health simple and easy. She helps people around the world eliminate suffering and gain clarity. She has created a new approach to understanding thinking and eliminating fear that causes negative thoughts and bad behaviors.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153958/Kim-Giles.jpeg"
        },
        "fc80a6e4-01ce-4922-8e7c-b1484381e06c": {
            "id": "fc80a6e4-01ce-4922-8e7c-b1484381e06c",
            "sessiontype": "breakout 6",
            "title": "Panel: How to Help Others Know About Your Dysphoria and Let Them in to Help?",
            "demographic": "Trans",
            "description": "With so few people who seem to really understand the issues surrounding gender identity, it can be difficult to find support from others. This panel will discuss the complexities of sharing what you are feeling and how to better express what you need. We will discuss how to ask for help and where to look for people who can relate.",
            "room": "Sundance",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Tricia Green",
            "speakerbio": "Mark and his wife Tricia feel blessed to be in love with their best friend. They spent five and a half years getting to know each other before marrying in 2017 in the Provo City Center Temple. Their love helps them navigate the unique experience of what it means to be transgender and Mormon. Avid outdoors people, Mark and Tricia enjoy spending time together, watching movies, and playing board games. Mark fixes sprinklers and Tricia teaches sixth grade. They live in Riverton, Utah, with their thirteen geese, four peacocks, and spunky dog.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153958/Kim-Giles.jpeg"
        },
        "9c6954e2-a7c9-4792-bc2a-ed7e5b78e280": {
            "id": "9c6954e2-a7c9-4792-bc2a-ed7e5b78e280",
            "sessiontype": "breakout 6",
            "title": "Panel: Finding Hope Through Other SSA Women's Experiences",
            "demographic": "SSA Women",
            "description": "There is power and peace in learning from others. As we move through our experiences, we not only gain knowledge and awareness for ourselves, but our trials can be a source of hope to others who find themselves in similar situations. Come listen with an open heart as SSA women share their stories.",
            "room": "Deer Valley",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Livier Mendoza",
            "speakerbio": "Livier was born and raised in Mexico. After graduating from Law School, she served in the Mexico City Northwest Mission. Later she moved to Utah where she felt the need to talk to someone about her same gender attraction. She reached out to a mission companion who recommended North Star. Being an SSA woman is a blessing that has allowed her to grow closer to the Savior and to open her heart to serve others unconditionally.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153910/Livier-Mendoza.jpg"
        },
        "058262b4-ac41-405d-9b9a-eeabb80b35a3": {
            "id": "058262b4-ac41-405d-9b9a-eeabb80b35a3",
            "sessiontype": "breakout 6",
            "title": "Having Hope in My Identity as a Child of God",
            "demographic": "General",
            "description": "Knowing who we truly are as children of God is one of the most hopeful and lasting truths in our lives; especially in a world that tries to get us to take on so many various identities. Come hear the stories of three North Star Community members as they share how they have been able to find hope and peace in more fully embracing their identities as children of God.",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Jeremy Wengren and Alma Wilson",
            "speakerbio": "*** Need Jeremy's Bio ***\n\nAlma was born and raised in San Antonio, Texas. Her family joined the church when she was seven years old, and are the only members of the church on both sides of the family. Alma left the church a few months after she came out in January 1997 but returned in July of 2009 hungry for the gospel in her life again. She has been married to her eternal companion David for five years, and they have two rambunctious boys that keep life busy.",
            "speakerphoto": ""
        },
        "e1c896c1-f2e4-4288-9745-49cbc697a409": {
            "id": "e1c896c1-f2e4-4288-9745-49cbc697a409",
            "sessiontype": "breakout 6",
            "title": "Thriving With No Conclusion",
            "demographic": "General",
            "description": "As humans we naturally crave certainty and closure. We even watch a horrible movie to the bitter end just to feel closure. Unfortunately, life often leaves us without conclusion or closure. In situations where we are left without an answer of what will happen, how do we build a good life? During this session, Andy Proctor will share research-based practices and principles of positive psychology that have been proven to boost positive emotion, provide individuals with a sense of meaning, and improve overall physical health. Andy has personally experienced a lengthy and confusing faith transition but has found a way to thrive through the science of happiness known as positive psychology.",
            "room": "Snowbird",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Andy Proctor",
            "speakerbio": "Andy is the host of the More Happy Life podcast, a published author, and a social media professional whose writings on mindfulness, the science of happiness, and life purpose have been featured in both academic and religious publications. He has built and managed social media pages that have reached hundreds of millions. Despite his uncertainty in his faith journey, his study of positive psychology has helped him to build an abundant, beautiful, and thriving life.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153859/Andy-Proctor.png"
        },
        "d052a74d-592c-4146-b47d-3a223d202216": {
            "id": "d052a74d-592c-4146-b47d-3a223d202216",
            "sessiontype": "breakout 6",
            "title": "Sacrifice Brings Forth the Blessings of Heaven",
            "demographic": "General",
            "description": "Bryan Young, author of “Meant for Heaven,” will be detailing the hardships and lessons learned from his four year old daughter, Holland's, battle with brain cancer. The presentation will be highlighting the blessings that come from the trials and the adversities that we face. Though our trials and questions may look very different on paper, in the end the answer is the same. Using the Atonement and the Plan of Salvation as tools we can each take our own: mental, emotional, physical, and spiritual trials and turn them into life lessons that will refine and shape us to become more like our Savior, Jesus Christ. If we begin to see the \"why\" in our trials, we can truly begin to see the \"who\" and the \"what\" we are becoming.",
            "room": "Brighton / Alta",
            "sessiontime": "2:45pm - 3:45pm",
            "speakername": "Bryan Young",
            "speakerbio": "Originally from Northern Virginia, Bryan has lived in Utah since returning from his mission to Idaho. He attended BYU where he met his wife Aleta and currently works as a school psychologist for Provo City School District. They are parents to four children and live in Springville, Utah. Bryan enjoys BYU sports, running, playing the guitar, writing music, sharing his testimony. He and his wife are grateful for every chance he has to share Holland’s story.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153932/Bryan-Young.jpg"
        },
        "396760c0-51d6-4302-b74a-b806fa3592c9": {
            "id": "396760c0-51d6-4302-b74a-b806fa3592c9",
            "sessiontype": "breakout 1",
            "title": "Steps to Loving, Joyful, and Fulfilling Relationships.",
            "demographic": "Spouses",
            "description": "Do you have expectations of what your relationship should be like or what your spouse or partner must change in order for you to be happy? If so, this workshop will help you navigate through letting go of expectations and finding joy in so many loving, fulfilling, and unexpected ways.",
            "room": "Sundance",
            "sessiontime": "10:45am - 12:15pm",
            "speakername": "Tera Brown and Rosa Lauper",
            "speakerbio": "Tera’s healing journey began four years ago when she awoke from a lifelong pattern of avoiding and denying her emotions. Since then, she has staffed many support groups and experiential weekends. She has also co-led and presented at several conferences. She is a Certified Life Coach specializing in Neuro-Linguistic Programming. Tera and her husband Curtis have been married 22 years and have four children.\n\nRosalinda is an entrepreneur, wife, mom, and yogi who helps people find transformation. She has learned so much on her yoga mat: how to breathe and surrender, find peace among the stress, and learning that working through the pain heals the pain. She’s staffed experiential weekends and retreats. She’s her daughter’s #1 soccer fan and Bronson’s eternal companion. It brings her pleasure to share her personal experience of strength and hope with the North Star.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153802/Tera-Brown1.jpeg"
        },
        "e3ffcac4-47ee-4804-91e0-8922273a5ad5": {
            "id": "e3ffcac4-47ee-4804-91e0-8922273a5ad5",
            "sessiontype": "breakout 1",
            "title": "You Are More Than Enough",
            "demographic": "General",
            "description": "We are of great worth; this truth is non-negotiable. In this session, Ganel-Lyn will discuss how you have sufficient grace, divinity, determination, courage, and belonging. We will have an honest and relatable conversation about faith, worth, and how to cultivate divine confidence so you can live your life to your fullest potential.",
            "room": "Wassatch",
            "sessiontime": "10:45am - 12:15pm",
            "speakername": "Ganel -Lyn Condie",
            "speakerbio": "Ganel-Lyn is a popular motivational speaker known for inspiring others with her honesty, authenticity, and spirit. After the heartbreaking suicide of her sister, she constantly works towards awareness and prevention. She has an open heart and feels passionate about sharing principles that empower others to live a joyful life. She loves growing older with her husband Rob and two children; having healed from a major chronic illness she aims to keep learning and loving.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153754/Ganel-Lyn-Condie1.jpg"
        },
        "0512aef7-e1fc-4510-9eb1-12ef701819eb": {
            "id": "0512aef7-e1fc-4510-9eb1-12ef701819eb",
            "sessiontype": "breakout 1",
            "title": "Awake and Arise: Centering Faith in and Applying the Atonement of Jesus Christ",
            "demographic": "General",
            "description": "Christ said unto Moses, “I AM THAT I AM” (Exodus 3:14) and to the Jews, “Before Abraham was, I AM” (John 8:58). The phrase, “I am” is the most powerful statement we can make about ourselves. What I am, are you holding? Do you know and feel the truth of who you truly are? We came to this earth to learn and grow and were provided a Savior through which redemption may come. However, there are times that redemptive power seems too abstract or out of reach. In this session we will discuss how to center our faith in Christ and practically apply the Atonement. We will discuss the reality of light and darkness; the truth about the subtle energies in, around, and upon us; how they affect us, and how we can overcome them. We can truly awake and arise out of the dust, shake off our shackles, and live in the love, light, and truth our Savior offers us.",
            "room": "Brighton / Alta",
            "sessiontime": "10:45am - 12:15pm",
            "speakername": "Tonya Cox",
            "speakerbio": "Tonya is married to her high school sweetheart, is a mother, and grandmother. She graduated from BYUI in Marriage and Family Studies and is a Rapid Eye Technician and Life Skills Coach. She assists individuals in treating emotional trauma, releasing limiting beliefs, and damaging family patterns. “We cannot lift anyone onto any higher ground than that upon which we stand. We often experience what we are not, to come to know who we truly are.”",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03154002/Tonya-Cox1.png"
        },
        "18819eb3-12eb-4226-9e57-38b44dbad84f": {
            "id": "18819eb3-12eb-4226-9e57-38b44dbad84f",
            "sessiontype": "breakout 1",
            "title": "Legit Tools for Dealing with Compulsive and Addictive Sexual Behaviors",
            "demographic": "General",
            "description": "This session will focus on practical, emotional, and spiritual tools and principles that have been used by many in preventing and overcoming compulsive pornography use; including other potentially addictive sexual behaviors. We will also explore the impact that these behaviors have on our brains, our self-worth, our relationships with loved ones, and ultimately, our spiritual journey.",
            "room": "Deer Valley",
            "sessiontime": "10:45am - 12:15pm",
            "speakername": "Dan Gray",
            "speakerbio": "Dan is a licensed clinical social worker and Certified Sexual Addiction Therapist (CSAT). He is co-founder of the LifeSTAR Network, a program which provides counseling for individuals and couples dealing with problems related to sexual addictions and compulsive behaviors. Dan has co-authored several books on these subjects, including: Confronting Pornography: A Guide to Prevention and Recovery for Individuals, Loved Ones, and Leaders. He has trained therapists throughout the United States, Eastern Europe, and China.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153955/Dan-Gray.jpg"
        },
        "f968a24d-6124-40e5-886b-3aecf6da8ad5": {
            "id": "f968a24d-6124-40e5-886b-3aecf6da8ad5",
            "sessiontype": "breakout 1",
            "title": "Panel: How to Have Hope and Remain Faithful Regardless of Your Transitionary State?",
            "demographic": "Trans",
            "description": "None are exempt from the enduring strength made available through adhering to eternal gospel principles; but finding hope on our journey can be difficult. This panel will discuss how others have been able to hold onto hope regardless of their transitionary state. Learn from others and find hope and healing through your life's journey.",
            "room": "Powder Mtn / Solitude",
            "sessiontime": "10:45am - 12:15pm",
            "speakername": "Brandon Jenson",
            "speakerbio": "Brandon and his wife live in Eagle Mountain with their four children. He is a licensed clinical social worker at Highland Springs Specialty Clinic and Encircle House. He came out five years ago as transgender. They have written an essay for North Star’s Journeys of Faith project and appeared on the Listen, Learn and Love Podcast. Brandon enjoys sharing his story with others as a way to provide hope for others in similar situations.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153846/Brandon-Jenson.jpg"
        },
        "5c5d50b2-75af-4326-9310-255bb7038da0": {
            "id": "5c5d50b2-75af-4326-9310-255bb7038da0",
            "sessiontype": "breakout 1",
            "title": "Being the Parent Your Child Needs",
            "demographic": "Family/Friends",
            "description": "Learning to understand the needs of your child and to parent them accordingly is often a complicated journey. In this session, Scott Mackintosh and Preston Jenkins share why being the parent your child needs is so crucial. Scott is the transformed father from The Mackintosh Story, featured on the church’s Mormon and Gay website. Preston is the remarkable missionary that Elder Holland spoke of in the conference talk, “Behold Thy Mother” who returned to the mission field five years after coming home early. You will be inspired by their stories and experiences as you learn to more fully love, support, and meet the needs of your children.",
            "room": "Snowbird",
            "sessiontime": "10:45am - 12:15pm",
            "speakername": "Scott Mackintosh Preston Jenkins",
            "speakerbio": "Scott has a diverse background in sales, concrete construction, and archery hunting in the great outdoors. He has served in countless church callings and is currently the bishop of a young single adult ward. He has put into practice much of what he has learned as a father of a gay son. The Mackintosh Story is a featured video on the Mormon and Gay website.\n\nPreston was born and raised in Las Vegas. He served a mission in Tokyo but returned home early due to injury. After several years of struggling with his sexual identity and his spirituality, he chose to remain a member of the church and finished his mission in Atlanta. Preston's story was shared in Elder Holland's General Conference Address, \"Behold Thy Mother.\" He resides in Provo, attends BYU, and teaches at the MTC.",
            "speakerphoto": ""
        },
        "18625e9a-7c77-4c71-890c-40fc2591a7c3": {
            "id": "18625e9a-7c77-4c71-890c-40fc2591a7c3",
            "title": "QPR: Suicide Prevention Training",
            "demographic": "Suicide",
            "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
            "room": "Big Cottonwood",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Jeff Case",
            "speakerbio": "Although Jeff was born in upstate New York, he grew up all over the world as a military child. As an adult, he attended BYU earning degrees in Music and Psychology, spent eight years as a clinical psychologist in the Army, and currently provides counseling services to military veterans and their families. He has been married to his best friend Sarah for 21 years; they are the parents of three children and live in Utah County.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2017/03/15215338/Photo-Cropped-05.jpg",
            "sessiontype": "KEYNOTE 2"
        }
    },
    "keynotes": [
        {
            "id": "18625e9a-7c77-4c71-890c-40fc2591a7c3",
            "title": "QPR: Suicide Prevention Training",
            "demographic": "Suicide",
            "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
            "room": "Big Cottonwood",
            "sessiontime": "1:45pm - 2:45pm",
            "speakername": "Jeff Case",
            "speakerbio": "Although Jeff was born in upstate New York, he grew up all over the world as a military child. As an adult, he attended BYU earning degrees in Music and Psychology, spent eight years as a clinical psychologist in the Army, and currently provides counseling services to military veterans and their families. He has been married to his best friend Sarah for 21 years; they are the parents of three children and live in Utah County.",
            "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2017/03/15215338/Photo-Cropped-05.jpg",
            "sessiontype": "KEYNOTE 2"
        }
    ],
    "breakouts": {
        "BREAKOUT 5": [
            {
                "id": "effeedb5-3110-4093-a984-590f1cf9ff8f",
                "sessiontype": "breakout 5",
                "title": "Panel: Healthy Ways to Communicate Your Needs in Marriage",
                "demographic": "Spouses",
                "description": "Lasting relationships require communication and flexibility. Working together to meet each other's needs is a dance that can create a meaningful and lasting relationship. Learning to communicate our needs in healthy ways can bring trust, safety, and connection to any marriage. On this panel, we will share experiences that have worked for us in our marriages.",
                "room": "Deer Valley",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Tera Brown",
                "speakerbio": "Tera’s healing journey began four years ago when she awoke from a lifelong pattern of avoiding and denying her emotions. Since then, she has staffed many support groups and experiential weekends. She has also co-led and presented at several conferences. She is a Certified Life Coach specializing in Neuro-Linguistic Programming. Tera and her husband Curtis have been married 22 years and have four children.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153802/Tera-Brown1.jpeg"
            },
            {
                "id": "6c6d4717-9420-46fa-b14f-ea41f4f0cd42",
                "sessiontype": "breakout 5",
                "title": "Increasing Self-Awareness: How to Respond to My Attractions in a Healthy Way?",
                "demographic": "SSA Men",
                "description": "Change is Inevitable. Growth is Optional. Have you ever wondered about the purposes of your same sex attraction? How have you been shaped or changed by your attractions to others? In this session, we will learn how to become aware of our attractions while identifying whether we are “acting on our attractions or taking action because of our attractions.” Attuning to our emotions by aligning our heart and mind unlocks our inner potential for self-actualization. Come learn how this gift might bless your life with unimaginable rewards when used in tandem with our Savior’s healing hands.",
                "room": "Sundance",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Pret Dahlgren",
                "speakerbio": "As a teen Preston moved to Utah with his family. He’s been married for 13 years; with four children and a fifth on the way. Stella, their \"Angel daughter,\" passed after birth. He works as a Director of Surgical Services for Intermountain Healthcare. He has a masters in Marriage and Family Therapy and practices as a LAMFT counselor specializing in helping individuals overcome obstacles that prevent them from determining their own path through life.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03154001/Pret-Dahlgren1.jpg"
            },
            {
                "id": "cb46c1f6-42c6-4e8b-85db-f37da6799019",
                "sessiontype": "breakout 5",
                "title": "The Dead-ends, U-turns, and Roadblocks of SSA Women's Journeys: Navigating Emotional and Spiritual Health",
                "demographic": "SSA Women",
                "description": "Every SSA woman’s journey is different, no two are the same. However, we can still learn from one another's dead-ends, u-turns, and roadblocks. In this session we will dig deep to uncover our own personal roadblocks and explore ways to find a road that fits us emotionally and spiritually.",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Brittany Ellis",
                "speakerbio": "Brittany lives in California with her husband and three kids. She became aware of her feelings of being gay at twelve years old and began her journey into figuring out how they fit into God's plan. Brittany found North Star when she was letting go of the shame that she had felt about being gay; embracing who she is and God’s love for her. Brittany found a sense of connection and belonging and loves being a part of this community.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153822/Brittany-Ellis.jpg"
            },
            {
                "id": "f1d1c808-7fcd-4776-96f9-88d287a0315c",
                "sessiontype": "breakout 5",
                "title": "Strengthening Your Marriage With Your Transgender Spouse",
                "demographic": "Trans",
                "description": "Every marriage has many unique nuances that can impact the ability to sustain peace and happiness. There is perhaps no more apparent example of this than in a marriage in which a spouse experiences gender variance. Regardless of the circumstances, marriages are most fulfilling when both partners have ownership over their own well-being and understand the role they play in the well-being of their spouse. In this session, we will discuss some of the unique challenges facing married couples grappling with issues surrounding gender and gender identity while striking a balance between sacrifice and self-fulfillment.",
                "room": "Snowbird",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Blaine Hickman",
                "speakerbio": "Blaine has worked as a therapist in Northern Utah for nine years as an Inpatient Therapist at McKay-Dee Hospital and at Aspire Counseling group until four years ago when he started his own practice where he works with individuals; both married and single, who experience issues surrounding sexual orientation, gender identity, internal conflict of religious beliefs, and sexual identity. Blaine has been married to Lindsay for 14 years and have three boys.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153841/Blaine-Hickman.jpg"
            },
            {
                "id": "f5904298-c7a0-497a-8c5d-c774ede0e362",
                "sessiontype": "breakout 5",
                "title": "Ministering to LGBT Teens",
                "demographic": "Leadership",
                "description": "If a youth in your stewardship came out would you feel prepared to support them? This session will be filled with applicable ideas for how to help youth in your stewardship feel safe, loved, and supported regardless of what journey they are on. We invite you to join Diana Hoelscher in learning and understanding from real successes and failures. This class will identify doctrines that create powerful links between our LGBTQ+ teens and our Savior.",
                "room": "Wassatch",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Diana Hoelscher",
                "speakerbio": "Diana grew up in Madison, WI. She served in the Washington Tacoma Mission then taught at the MTC. As a published author, she has served in many callings in the church and has spoken in stakes for over 20 years. Diana resides in Spring, Texas with her family. She has a burning desire to share the gospel and the spiritual gift to bare her testimony to others.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153838/Diana-Hoelscher.jpg"
            },
            {
                "id": "63384374-c7b4-42b2-b541-6469d28e0cf7",
                "sessiontype": "breakout 5",
                "title": "My Story: Finding Hope While Single",
                "demographic": "General",
                "description": "Is it possible to maintain hope while single and dealing with challenges of same-sex attraction? It can often be a lonely and challenging road, but a very possible one. Come hear the stories of three different individuals as they share their experiences of what has brought them hope and how they have been able to make the single life work for them.",
                "room": "Brighton / Alta",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Mark Buckley, Bryan Hill, and Kelly Quinn",
                "speakerbio": "Mark’s journey has been one of navigating growth and change. Originally from Wyoming, he currently lives in Modesto, owns an insurance agency, has three daughters, and was divorced after 29 years of marriage. He served a mission in Argentina and earned a degree in Family Financial Planning and Counseling from BYU. He is currently Ward Choir Director and Ward Historian/Newsletter Editor and also serves on the North Star Executive Committee as Vice President of Online Communities.\n\nBryan was born and raised in Clinton, Utah. After serving a mission in Oklahoma he graduated from USU with a bachelors in Marketing. Bryan began his journey fifteen years ago which led him to North Star. He has a deep love for the Savior and a strong testimony of the gospel. He currently serves as elders quorum president in his mid-singles ward. He loves spending time with family and friends and being active outdoors.\n\nAs a child, one of Quinn’s most vivid memories was being sealed to her parents in the Los Angeles Temple. As an adult, she moved to Utah for work. Four years ago, she discovered North Star when she was looking for a community to support her in her experiences with same-sex attraction. Quinn enjoys living in Utah, being an aunt, and leading an active lifestyle.",
                "speakerphoto": ""
            }
        ],
        "BREAKOUT 3": [
            {
                "id": "7b1e2f3d-d254-4994-b011-ffc83444fda2",
                "sessiontype": "breakout 3",
                "title": "QPR: Suicide Prevention Training",
                "demographic": "General",
                "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
                "room": "Big Cottonwood",
                "sessiontime": "1:30pm - 2:30pm",
                "speakername": "Debra and Don Coe",
                "speakerbio": null,
                "speakerphoto": null
            },
            {
                "id": "6ddf7c4b-6b68-4248-903b-ab5b68e73fe5",
                "sessiontype": "breakout 3",
                "title": "Working Through Trauma in Marriage and Relationships: Balancing Compassion With Self-care",
                "demographic": "Spouses",
                "description": "As members of the LDS church we are taught the importance of forgiving and showing compassion to others and yet we also have emotional needs that cry out for attention. By focusing on self-care, establishing healthy boundaries, and holding space for our loved ones to heal from trauma, we are ensuring that both individuals have the opportunity to heal. This workshop will address how we can be angry and compassionate at the same time while maintaining composure in the face of intense pain and betrayal. Marianne will also map out the relationship between fear, anger, resentment, and the desire to control. She brings to this session a combination of both personal and professional experience in transforming trauma into personal strength.",
                "room": "Sundance",
                "sessiontime": "3:00pm - 4:00pm",
                "speakername": "Marianne Downing",
                "speakerbio": "Marianne was a therapist with LDS Family Services in 1986. In 2008 she moved to Paris and was called by the European Area Presidency to help establish LDS Family Services in French-speaking Europe. In 2012, she met her husband and moved to the US where she works as a consultant and coach. She is a mother of six and grandmother to eight with a masters degree in education, guidance, and counseling.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153814/Marianne-Downing.jpg"
            },
            {
                "id": "8f18fbea-3408-4bc8-9485-4a1e756a515e",
                "sessiontype": "breakout 3",
                "title": "Panel: Empowering Tools to Build My Community at Church and Amongst Peers",
                "demographic": "General",
                "description": "How do you talk with ward members about SSA or gender dysphoria? Are you coping with feelings of isolation within the church and LGBTQ+ community? In this session, we will be discussing tools to help build a safe community at church and how to better enlighten and support members who don't understand.",
                "room": "Deer Valley",
                "sessiontime": "3:00pm - 4:00pm",
                "speakername": "Courtney Ebmeyer",
                "speakerbio": "Courtney is excited to be facilitating a panel this year at the North Star Conference. Her passions in life are her five children; Brent, her husband of 15 years; and the gospel. Courtney is very driven and loves setting goals and going after them. She is grateful for the North Star community, for the resources she has received from it, and the support it gives to others. Courtney and Brent currently reside in Southern California.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153820/Courtney-Ebmeyer.jpg"
            },
            {
                "id": "b9c4e608-07ec-4d4f-984d-7d7489cc99b4",
                "sessiontype": "breakout 3",
                "title": "Understanding Healthy Male Relationships",
                "demographic": "SSA Men",
                "description": "Many men who are coming to terms with their sexual orientation share a history of difficulty connecting with other men in meaningful, healthy, and satisfying friendships. Even for men who have always had friendships with other men, being open about sexual orientation in these relationships can be scary and intimidating. In this session we will talk about some of the difficulties that exist in establishing fulfilling, platonic, healthy relationships within the SSA/Gay community and how to avoid frustrating patterns that often come when learning how to be vulnerable and open in friendships.",
                "room": "Brighton",
                "sessiontime": "3:00pm - 4:00pm",
                "speakername": "Blaine Hickman",
                "speakerbio": "Blaine has worked in Northern Utah for nine years as an Inpatient Therapist at McKay-Dee Hospital and at Aspire Counseling group until four years ago when he started his own practice where he helps both single and married individuals who experience issues surrounding sexual orientation, gender identity, internal conflict of religious beliefs, and sexual identity. Blaine has been married to Lindsay for 14 years and have three boys.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153841/Blaine-Hickman.jpg"
            },
            {
                "id": "dd40eae1-6d67-468e-8eb2-c6966fac9423",
                "sessiontype": "breakout 3",
                "title": "Panel: A House Divided: Navigating Family Dynamics",
                "demographic": "Family/Friends",
                "description": "Is SSA splitting your family apart? Does it cause contention between family members? Do you feel uncomfortable talking to your family members about their same-sex attraction? Do you feel that supporting your SSA son or daughter means that you are condoning their choices? In this panel we will discuss ways in which each member of the family can feel validated, loved, and accepted. We will discuss the difference between condoning and accepting and outline ways to facilitate a respectful and safe space for everyone to be able to express their feelings and opinions without creating an atmosphere of judgement and contention.",
                "room": "Snowbird",
                "sessiontime": "3:00pm - 4:00pm",
                "speakername": "Debby Jackson",
                "speakerbio": "Debby found North Star in 2013 after her youngest child came out as SSA. She then co-chaired the 2014/2015 conferences. A convert, return missionary, and BYU graduate; she works at BYU in the School of Communications. She enjoys an active life and visiting her eight grandchildren. She loves the Gospel and believes that our challenges strengthen us and increase our faith in Him; and it’s up to us to help each other make our way back to Him.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153829/Debby-Jackson.jpg"
            },
            {
                "id": "b2978cde-10db-450a-9967-cc381f826353",
                "sessiontype": "breakout 3",
                "title": "Led By the Spirit: How I Felt My Way Back?",
                "demographic": "General",
                "description": "Figuring out how to make our lives work within the framework of the gospel while dealing with attractions to the same sex or challenges around gender identity can be a complex and daunting experience. Come listen and learn from the powerful testimonies of North Star Community members as they share their experiences with finding their way back to God and the gospel.",
                "room": "Wassatch",
                "sessiontime": "3:00pm - 4:00pm",
                "speakername": "Neil Petersen, Preston Jenkins, and Ann Pack",
                "speakerbio": "Recently returned to church activity, Neil is anxious to help others discover or rekindle what is missing from experiencing a fullness of life through his calling as a ward missionary. An obsessive interior designer, devoted dog-dad, doting uncle, and ever-improving disciple of Christ, Neil's life now feels fuller and richer. He has no doubt that the Savior can make more of us than we can make of ourselves.\n\nPreston was born and raised in Las Vegas. He served a mission in Tokyo but returned home early due to injury. After several years of struggling with his sexual identity and his spirituality, he chose to remain a member of the church and finished his mission in Atlanta. Preston's story was shared in Elder Holland's General Conference Address, \"Behold Thy Mother.\" He resides in Provo, attends BYU, and teaches at the MTC.\n\nAnn served a mission in London and married in the Bountiful Temple 19 years ago. After 15 years of marriage, she could no longer keep the secret that she was transgender. Instead of divorcing, they have chosen to stay together even though at times this has been extremely difficult for them. They live in Syracuse with their 14-year-old daughter and are passionate about bringing more understanding and awareness of LGBTQ+ members to the church.",
                "speakerphoto": null
            },
            {
                "id": "773d34b0-a6da-4d11-8ad2-73929a3406d3",
                "sessiontype": "breakout 3",
                "title": "Building and Keeping Healthy Relationships With Women (Closed door women's session)",
                "demographic": "SSA Women",
                "description": "In this session we will discuss what contributes to a healthy relationship and reverse ill-serving habits of co-dependency. We will also explore how to navigate relationships from a place of self-compassion, a balance of investments, setting healthy boundaries, and understanding what it takes to participate in constructive confrontations, i.e. “fighting fair.” Your stories and questions are a vital part of this conversation.",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "3:00pm - 4:00pm",
                "speakername": "Kara Posner",
                "speakerbio": "Kara has been practicing as a Licensed Clinical Mental Health Counselor in Salt Lake City for the past eight years. In her private practice she works with people from a broad range of faiths and enjoys learning from the various stories and experiences she hears. She is an active member of the LGBTQ+ Affirmative Therapists Guild of Utah and supervises students in the University of Utah CMHC program.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153930/Kara-Posner.png"
            }
        ],
        "BREAKOUT 2": [
            {
                "id": "24e6a0d8-9190-4a29-9ce4-0cdfccfce426",
                "sessiontype": "breakout 2",
                "title": "Finding Peace in My Sexuality as a Same-sex Attracted Woman",
                "demographic": "SSA Women",
                "description": "I am: Same-sex attracted. Gay. Lesbian. Bisexual. Pansexual. Or, whatever term you prefer. Labels have changed over the years and continue to do so. How can we find clarity with so many different perspectives regarding sexual orientation? Where can we turn for peace, especially with regards to our sexuality, attractions, identity, and faith? We’ll explore the possibilities and how we can apply them in our lives.",
                "room": "Sundance 100",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Laurie Campbell",
                "speakerbio": "Laurie is a Nationally Certified Counselor with a masters degree in counseling. As a 30 volunteer veteran, she has helped and supported fellow SSA/LGBTQ+ individuals. In 1994, she wrote and published Deseret Book’s first book on SSA entitled, “Born That Way?” using a pseudonym. Then in 2013, she wrote “Reborn that Way” under her married name. She has a video on the Mormon and Gay website.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153756/Laurie-Campbell1.jpg"
            },
            {
                "id": "1bbc2879-eb7d-4a21-bf6b-b921a60deed6",
                "sessiontype": "breakout 2",
                "title": "QPR: Suicide Prevention Training",
                "demographic": "General",
                "description": "Suicide awareness, prevention, and training have saved many lives. This in-depth hands-on session is twofold; first, Jeff Case will focus on the key identifiers associated with individuals contemplating suicide along with the need for training people in suicide prevention. Second, Don and Deborah Coe will provide attendees with the opportunity to receive training in the QPR (Question, Persuade, and Refer) model. People trained in the QPR model learn how to recognize the warning signs of a suicide crisis and offer “buddy aid.”",
                "room": "Big Cottonwood",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Debra and Don Coe",
                "speakerbio": null,
                "speakerphoto": null
            },
            {
                "id": "924e642d-6a1b-4152-89ce-ca4352455ecb",
                "sessiontype": "breakout 2",
                "title": "Panel: Pursuing Mixed-Orientation Relationships: What to Consider?",
                "demographic": "General",
                "description": "The big “M” word is a pretty big deal. How do I even know if it’s for me? What do I need to know for it to work? How can I develop the faith/hope/love necessary to succeed in this important relationship? Is it worth it? Bring your heartfelt questions and prayers to learn from couples who have asked similar questions and who are finding and applying beautiful answers and insights.",
                "room": "Deer Valley 150",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Vaughn Armstrong",
                "speakerbio": "A native Arizonian, Vaughn grew up in an active household with five other siblings. As a return missionary and graduate from BYU; Vaughn recognized his attractions to men while in college. His desire to live by faith and his own personal covenants set him on a difficult path of discovery which lead him to North Star. He’s grateful for the support, resources, personal growth, friendships, forgiveness, and miracles he’s experienced while on his journey.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2018/11/17174330/2019-NS-Bio-Pics-5.png"
            },
            {
                "id": "ec0eace8-cbb9-40f9-9d60-dabf08fb7d83",
                "sessiontype": "breakout 2",
                "title": "Building the Trans Community: Coming Together Regardless of Our Differences",
                "demographic": "Trans",
                "description": "There is power in sharing our unique stories with each other. We all have our own road to travel and bonds are formed when we share our experiences while on our journey. In this breakout session, we will learn vital strategies that help us come together to strengthen those bonds.",
                "room": "Snowbird",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Ed Hayward",
                "speakerbio": "Born Methodist, Ed's parents joined the LDS church when he was about four years old. He grew up in Illinois but moved to Utah in 2001. Ed met his wife at BYU after a mission to Japan-Fukuoka. They then married and moved to Japan to be near her family. He's an entrepreneur and worked overseas for about 12 years. Ben and his wife have two children. He loves spending time with family, singing, camping, and hiking.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153952/Ed-Hayward.jpg"
            },
            {
                "id": "6eb143be-767b-408a-94ba-cb5817a7917f",
                "sessiontype": "breakout 2",
                "title": "Building Brotherhood",
                "demographic": "SSA Men",
                "description": "What are the core qualities of a great friendship? What are the characteristics of a lasting brotherhood of men that stick around for the long haul? In this interactive workshop we will look at elements that connect men at a heart-level and how to cultivate those qualities in our day-to-day connections.",
                "room": "Wassatch",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Tim Timmerman",
                "speakerbio": "Tim is a dedicated, truth-seeking, Christ-following individual who is passionate about writing, curating, and family. As a professional artist, 25-year veteran professor, and published author; Tim enjoys teaching young adults at George Fox University in Oregon. He published his book, \"A Bigger World Yet; Faith, Brotherhood, and Same-Sex Needs,\" in 2011. He continues to seek the Spirit’s influence in all aspects of his daily life.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2018/11/17163116/2019-NS-Bio-Pics-3.png"
            },
            {
                "id": "e055c445-7094-45e7-921b-2320774300db",
                "sessiontype": "breakout 2",
                "title": "Finding Hope in God: Principles for Thriving in Life and Fostering Self-Acceptance",
                "demographic": "General",
                "description": "When life doesn’t work out the way we planned it is natural to get discouraged. This session will discuss principles that allow us to have hope for the future, while also living in the here and now. Whether single, dating, or married we can experience peace and joy now in our lives.",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Ben Schilaty",
                "speakerbio": "Originally from Washington, Ben now lives in Provo and will be graduating from BYU in April with a masters in Social Work. In his spare time, he works as an intern at LDS Family Services. Fluent in both Spanish and Portuguese, Ben’s lived abroad in Mexico, Bolivia, Peru, and Portugal. He currently serves in his ward’s Sunday School presidency and as an ordinance worker in the Provo Temple.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153914/Ben-Schilaty.png"
            },
            {
                "id": "3bb402de-f669-4ecc-a0f5-90b6640ca3e3",
                "sessiontype": "breakout 2",
                "title": "Faith in Every Footstep: Stepping Into a New World of Family, Church and Friendships After Your Child Has Come Out",
                "demographic": "Family/Friends",
                "description": "After your child has come out it can be difficult to navigate your own emotions let alone relationships with family and friends. Strength, courage, testimony, and peace all bring new experiences and perspectives that are vital when interacting with our local and church community. Come discuss, listen, and share how powerful and beautiful it can be as you come out to others as the parent of an LGBTQ+ child. Remember to stand steadfast and look to God for the rest.",
                "room": "Brighton / Alta",
                "sessiontime": "1:45pm - 2:45pm",
                "speakername": "Rebecca Silva",
                "speakerbio": "Rebecca, her husband, and three children live in Central Florida. Homeschooled during her early years, she became a part-time professional photographer, earned her associates in graphic design, and became an ASL Interpreter. They became grandparents when her oldest daughter adopted a child. Their son came out as experiencing SSA five years ago. Their youngest daughter came out as pan-romantic and asexual a year and a half ago and recently become engaged to a transgender young man.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153928/Rebecca-Silva.jpg"
            }
        ],
        "BREAKOUT 4": [
            {
                "id": "918e4292-9e13-4253-a239-ddd86bc448f3",
                "sessiontype": "breakout 4",
                "title": "As I Am - Finding Myself Through Christ",
                "demographic": "SSA Men",
                "description": "There are many models of masculinity in the world today, but the ultimate example of masculinity was our Savior, Jesus Christ. Come partake in an experiential presentation for men about discovering and developing Christ-based masculinity.",
                "room": "Brighton / Alta",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Curtis Brown",
                "speakerbio": "Curtis has spent the last 10 years seeking healing in his own life. Through this journey, he became certified as a life coach and received training in various healing modalities for emotional and psychological healing. Curtis helped found a non-profit organization, Discover Identity, to help people learn about emotional intelligence, identity, and grief recovery. He has been married to his wife Tera for 25 years and have four children.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153806/Curtis-Brown.jpg"
            },
            {
                "id": "cfe7afde-de22-4a49-a859-97cce97091f6",
                "sessiontype": "breakout 4",
                "title": "How to Combat Depression and Anxiety While Staying Faithful?",
                "demographic": "General",
                "description": "We believe in a refining God. While this concept, in theory, may make sense to us; how can we remember to remain fixed while standing amidst our burning fire? How do we stay true to the promises, covenants, and hopes we have cultivated with our Father? How do we move past our mortal experiences and stand steadfast in our eternal progression?",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Taryn Dipo",
                "speakerbio": "Taryn was born and raised on a dairy farm in Draper, Utah. She and her husband of 13 years currently reside in Lehi, Utah where she is a stay at home mom. She loves serving in the immunocompromised intensive care unit at primary children’s hospital, has completed various humanitarian trips around the world, works with local refugees, and volunteers to stop child trafficking.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153811/Taryn-Dipo.jpeg"
            },
            {
                "id": "406b9dbd-5ae7-4b3e-bdcb-054af506a883",
                "sessiontype": "breakout 4",
                "title": "Panel: How to Better Understand Your SSA/Gay or Trans Members in Your Congregation? (Returning Leader Attendees)",
                "demographic": "Leadership",
                "description": "Every leader wants everyone in their congregation to feel comfortable enough to worship at church on Sundays. They also want each individual to benefit from the community and friendship of a ward experience. Come listen to real life experiences where members who experience same-sex attraction have found peace and community among fellow Latter-day Saints largely due to the helpful fellowshipping tactics displayed by their local leaders. We invite you to bring questions and hope you leave feeling better prepared to love all members of your ward.",
                "room": "Deer Valley",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Kurt Francom",
                "speakerbio": "Kurt is the Executive Director and host of Leading Saints, a non-profit organization dedicated to helping LDS lay leaders be better prepared to lead. He enjoys drawing caricatures, playing basketball, reading, and watching college football. He served a mission in Sacramento, was an elder’s quorum president, executive secretary, bishopric counselor, bishop, and served in the stake presidency. He currently lives in Holladay, Utah with is his wife Alanna and two children.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153826/Kurt-Francom.jpg"
            },
            {
                "id": "11aeb34d-1dde-4766-8ad4-ea1c40720a2d",
                "sessiontype": "breakout 4",
                "title": "“And Jesus Beholding Him Loved Him”",
                "demographic": "Leadership",
                "description": "\"True ministering is accomplished one by one with love as the motivation,” as taught by President Jean B. Bingham in the April 2018 Conference. In the story of Jesus and the rich young man, Jesus loved him for all that he was doing that was good, allowed him agency, and loved him even when he made a different choice (Mark 10:17–22). While Jesus is the model for our gospel service, as mortals we must recognize that we differ from him in that we don't have all the answers and we frequently make mistakes as we strive to be good shepherds. As we seek to minister to all of our members, including and especially those in the LGBTQ+ community, we must seek to better understand, patiently love, and not take a one-size-fits all approach with counsel. We may not comprehend the struggles of others; all we can do is love and support them where they are in their journey.",
                "room": "Wassatch",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Eric Huntsman",
                "speakerbio": "BYU graduate, Eric earned his masters and doctorate in ancient history from the University of Pennsylvania. He has taught at BYU and BYU Jerusalem Center and was coordinator of the Ancient Near Eastern Studies Program in the Kennedy Center for International Studies. An avid published author, he has spoken at BYU Education Week, Women’s Conference, and TOFW. He’s a member of The Tabernacle Choir at Temple Square. He and his wife Elaine have two children.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153835/Eric-Huntsman.jpg"
            },
            {
                "id": "2c1c128e-b981-45bc-b208-c63605410a86",
                "sessiontype": "breakout 4",
                "title": "Extreme Ownership: Empowering Your Marriage Through Understanding Boundaries",
                "demographic": "Spouses",
                "description": "Boundaries are not rules for someone else; they are a means of keeping you safe. When you understand healthy boundaries and the principle of extreme ownership you start to see what belongs to you and what belongs to others. This allows us to stop controlling and blaming as a means of discharging pain, permitting us to start living in a place of peace and wholeness. Find out how owning our feelings, thoughts, behaviors, and needs can lead to stronger more synergistic relationships with loved ones.",
                "room": "Snowbird",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Shelley Mangum",
                "speakerbio": "A lifetime of preparation has made Shelley a powerful and engaging presenter. She is not only a Licensed Clinical Mental Health Counselor in private practice, but also has taught Behavioral Health Education at UVU. She attends a women’s group; including spouses of SSA men. Her most cherished roles are that of mother and grandma. She loves seeking truth and helping facilitate positive change. She also loves adventures including hiking, biking, and camping.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153904/Shelley-Mangum.jpg"
            },
            {
                "id": "89da4ee8-061a-4153-bc11-06c241926c57",
                "sessiontype": "breakout 4",
                "title": "“Living Two Worlds: Who I Was Expected to Be vs Who I Am.” (Viviendo entre dos mundos: Quien Esperaban Que Fuera vs Quien Soy\"",
                "demographic": "Spanish",
                "description": "Encontrar el balance entre quien deseas ser y la ideas que las personas que te aman expresan sobre el camino que has elegido, puede dificultar el descubrir quien realmente eres. La forma en que comunicamos nuestras expectativas puede en ocasiones sentirse como una carga para otros. Cómo podemos construir nuestra identidad y testimonio como Hijos de Dios? Cuál es la mejor manera de comunicarnos con aquellos que están en el proceso de encontrar a verdadero reflejo? Acompáñanos para descubrir la importancia de tu lugar en el Plan de Salvación.                                                                   Finding balance between who you want to be and the ideas that your loved ones express about the path you choose to follow can make it difficult to discover who you truly are. The way we communicate our expectations can sometimes feel like a burden to others. How can we build our identity and testimony as children of God? What is the best way to communicate with those that are in the process of finding their true reflection? Join us to discover the relevance of your place in the Plan of Salvation.",
                "room": "Big Cottonwood",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Livier Mendoza",
                "speakerbio": "Livier was born and raised in Mexico. After graduating from Law School, she served in the Mexico City Northwest Mission. Later she moved to Utah where she felt the need to talk to someone about her same gender attraction. She reached out to a mission companion who recommended North Star. Being an SSA woman is a blessing that has allowed her to grow closer to the Savior and to open her heart to serve others unconditionally.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153910/Livier-Mendoza.jpg"
            },
            {
                "id": "e0f87147-d862-4d1e-9113-99b44671908b",
                "sessiontype": "breakout 4",
                "title": "Navigating Challenges of Faith",
                "demographic": "General",
                "description": "LGBTQ+ people of faith are faced with seemingly irreconcilable challenges and unanswerable questions on a daily basis. In this session we will take on these challenges and questions head-on. We will create a safe space to explore the very real challenges we face when our sexual/gender identities don't fit easily with our religious identities.",
                "room": "Sundance",
                "sessiontime": "10:30am - 12:00pm",
                "speakername": "Jana Spangler",
                "speakerbio": "Jana is a certified Integral Professional Coach whose work focuses on helping people affected by faith transition find balance and beauty in diversity and growth. The goal of her work is to strengthen self-determination, heal and strengthen relationships with others, and enable deep and lasting developmental growth in her clients. She lives in Holladay, Utah with her husband and three children, and is an active member of the LDS church.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153940/Jana-Spangler.jpg"
            }
        ],
        "BREAKOUT 6": [
            {
                "id": "c25360ce-ad64-430e-88ba-95d8c273cf90",
                "sessiontype": "breakout 6",
                "title": "Having Hope in My Identity as a Child of God",
                "demographic": "General",
                "description": "Knowing who we truly are as children of God is one of the most hopeful and lasting truths in our lives; especially in a world that tries to get us to take on so many various identities. Come hear the stories of three North Star Community members as they share how they have been able to find hope and peace in more fully embracing their identities as children of God.",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Brent Ebmeyer",
                "speakerbio": "Brent has been a member of The Church of Jesus Christ of Latter-day Saints his whole life and served a mission in Argentina. He and Courtney married in 2004 and have five children. A year after they were sealed in the temple, Brent shared that he experiences same-sex attraction. It took them to the brink of separation; but through consistent communication, compassion, and love they have been able to find hope in their future together.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153817/Brent-Ebmeyer.jpg"
            },
            {
                "id": "8e478340-593e-4b96-9fef-7f7bc92b5a37",
                "sessiontype": "breakout 6",
                "title": "How to Maintain Open, Constructive and Vulnerable Conversations With Loved Ones?",
                "demographic": "Family/Friends",
                "description": "Discussing same sex attraction can become challenging when it triggers our fears. When we experience fear, we stifle our capacity to show up with love. Coach Kim will teach you how to manage your fears, access your love, and handle difficult conversations with ease. Don’t miss this class, as it can also improve your relationship skills in other areas of your life.",
                "room": "Wassatch",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Kim Giles",
                "speakerbio": "Kim is an International Human Behavior Expert, professional speaker, and author. She's best known for her KSL articles, books, and podcasts and has a unique way of making psychology, mental, emotional, and social health simple and easy. She helps people around the world eliminate suffering and gain clarity. She has created a new approach to understanding thinking and eliminating fear that causes negative thoughts and bad behaviors.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153958/Kim-Giles.jpeg"
            },
            {
                "id": "fc80a6e4-01ce-4922-8e7c-b1484381e06c",
                "sessiontype": "breakout 6",
                "title": "Panel: How to Help Others Know About Your Dysphoria and Let Them in to Help?",
                "demographic": "Trans",
                "description": "With so few people who seem to really understand the issues surrounding gender identity, it can be difficult to find support from others. This panel will discuss the complexities of sharing what you are feeling and how to better express what you need. We will discuss how to ask for help and where to look for people who can relate.",
                "room": "Sundance",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Tricia Green",
                "speakerbio": "Mark and his wife Tricia feel blessed to be in love with their best friend. They spent five and a half years getting to know each other before marrying in 2017 in the Provo City Center Temple. Their love helps them navigate the unique experience of what it means to be transgender and Mormon. Avid outdoors people, Mark and Tricia enjoy spending time together, watching movies, and playing board games. Mark fixes sprinklers and Tricia teaches sixth grade. They live in Riverton, Utah, with their thirteen geese, four peacocks, and spunky dog.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153958/Kim-Giles.jpeg"
            },
            {
                "id": "9c6954e2-a7c9-4792-bc2a-ed7e5b78e280",
                "sessiontype": "breakout 6",
                "title": "Panel: Finding Hope Through Other SSA Women's Experiences",
                "demographic": "SSA Women",
                "description": "There is power and peace in learning from others. As we move through our experiences, we not only gain knowledge and awareness for ourselves, but our trials can be a source of hope to others who find themselves in similar situations. Come listen with an open heart as SSA women share their stories.",
                "room": "Deer Valley",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Livier Mendoza",
                "speakerbio": "Livier was born and raised in Mexico. After graduating from Law School, she served in the Mexico City Northwest Mission. Later she moved to Utah where she felt the need to talk to someone about her same gender attraction. She reached out to a mission companion who recommended North Star. Being an SSA woman is a blessing that has allowed her to grow closer to the Savior and to open her heart to serve others unconditionally.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153910/Livier-Mendoza.jpg"
            },
            {
                "id": "058262b4-ac41-405d-9b9a-eeabb80b35a3",
                "sessiontype": "breakout 6",
                "title": "Having Hope in My Identity as a Child of God",
                "demographic": "General",
                "description": "Knowing who we truly are as children of God is one of the most hopeful and lasting truths in our lives; especially in a world that tries to get us to take on so many various identities. Come hear the stories of three North Star Community members as they share how they have been able to find hope and peace in more fully embracing their identities as children of God.",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Jeremy Wengren and Alma Wilson",
                "speakerbio": "*** Need Jeremy's Bio ***\n\nAlma was born and raised in San Antonio, Texas. Her family joined the church when she was seven years old, and are the only members of the church on both sides of the family. Alma left the church a few months after she came out in January 1997 but returned in July of 2009 hungry for the gospel in her life again. She has been married to her eternal companion David for five years, and they have two rambunctious boys that keep life busy.",
                "speakerphoto": ""
            },
            {
                "id": "e1c896c1-f2e4-4288-9745-49cbc697a409",
                "sessiontype": "breakout 6",
                "title": "Thriving With No Conclusion",
                "demographic": "General",
                "description": "As humans we naturally crave certainty and closure. We even watch a horrible movie to the bitter end just to feel closure. Unfortunately, life often leaves us without conclusion or closure. In situations where we are left without an answer of what will happen, how do we build a good life? During this session, Andy Proctor will share research-based practices and principles of positive psychology that have been proven to boost positive emotion, provide individuals with a sense of meaning, and improve overall physical health. Andy has personally experienced a lengthy and confusing faith transition but has found a way to thrive through the science of happiness known as positive psychology.",
                "room": "Snowbird",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Andy Proctor",
                "speakerbio": "Andy is the host of the More Happy Life podcast, a published author, and a social media professional whose writings on mindfulness, the science of happiness, and life purpose have been featured in both academic and religious publications. He has built and managed social media pages that have reached hundreds of millions. Despite his uncertainty in his faith journey, his study of positive psychology has helped him to build an abundant, beautiful, and thriving life.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153859/Andy-Proctor.png"
            },
            {
                "id": "d052a74d-592c-4146-b47d-3a223d202216",
                "sessiontype": "breakout 6",
                "title": "Sacrifice Brings Forth the Blessings of Heaven",
                "demographic": "General",
                "description": "Bryan Young, author of “Meant for Heaven,” will be detailing the hardships and lessons learned from his four year old daughter, Holland's, battle with brain cancer. The presentation will be highlighting the blessings that come from the trials and the adversities that we face. Though our trials and questions may look very different on paper, in the end the answer is the same. Using the Atonement and the Plan of Salvation as tools we can each take our own: mental, emotional, physical, and spiritual trials and turn them into life lessons that will refine and shape us to become more like our Savior, Jesus Christ. If we begin to see the \"why\" in our trials, we can truly begin to see the \"who\" and the \"what\" we are becoming.",
                "room": "Brighton / Alta",
                "sessiontime": "2:45pm - 3:45pm",
                "speakername": "Bryan Young",
                "speakerbio": "Originally from Northern Virginia, Bryan has lived in Utah since returning from his mission to Idaho. He attended BYU where he met his wife Aleta and currently works as a school psychologist for Provo City School District. They are parents to four children and live in Springville, Utah. Bryan enjoys BYU sports, running, playing the guitar, writing music, sharing his testimony. He and his wife are grateful for every chance he has to share Holland’s story.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153932/Bryan-Young.jpg"
            }
        ],
        "BREAKOUT 1": [
            {
                "id": "396760c0-51d6-4302-b74a-b806fa3592c9",
                "sessiontype": "breakout 1",
                "title": "Steps to Loving, Joyful, and Fulfilling Relationships.",
                "demographic": "Spouses",
                "description": "Do you have expectations of what your relationship should be like or what your spouse or partner must change in order for you to be happy? If so, this workshop will help you navigate through letting go of expectations and finding joy in so many loving, fulfilling, and unexpected ways.",
                "room": "Sundance",
                "sessiontime": "10:45am - 12:15pm",
                "speakername": "Tera Brown and Rosa Lauper",
                "speakerbio": "Tera’s healing journey began four years ago when she awoke from a lifelong pattern of avoiding and denying her emotions. Since then, she has staffed many support groups and experiential weekends. She has also co-led and presented at several conferences. She is a Certified Life Coach specializing in Neuro-Linguistic Programming. Tera and her husband Curtis have been married 22 years and have four children.\n\nRosalinda is an entrepreneur, wife, mom, and yogi who helps people find transformation. She has learned so much on her yoga mat: how to breathe and surrender, find peace among the stress, and learning that working through the pain heals the pain. She’s staffed experiential weekends and retreats. She’s her daughter’s #1 soccer fan and Bronson’s eternal companion. It brings her pleasure to share her personal experience of strength and hope with the North Star.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153802/Tera-Brown1.jpeg"
            },
            {
                "id": "e3ffcac4-47ee-4804-91e0-8922273a5ad5",
                "sessiontype": "breakout 1",
                "title": "You Are More Than Enough",
                "demographic": "General",
                "description": "We are of great worth; this truth is non-negotiable. In this session, Ganel-Lyn will discuss how you have sufficient grace, divinity, determination, courage, and belonging. We will have an honest and relatable conversation about faith, worth, and how to cultivate divine confidence so you can live your life to your fullest potential.",
                "room": "Wassatch",
                "sessiontime": "10:45am - 12:15pm",
                "speakername": "Ganel -Lyn Condie",
                "speakerbio": "Ganel-Lyn is a popular motivational speaker known for inspiring others with her honesty, authenticity, and spirit. After the heartbreaking suicide of her sister, she constantly works towards awareness and prevention. She has an open heart and feels passionate about sharing principles that empower others to live a joyful life. She loves growing older with her husband Rob and two children; having healed from a major chronic illness she aims to keep learning and loving.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153754/Ganel-Lyn-Condie1.jpg"
            },
            {
                "id": "0512aef7-e1fc-4510-9eb1-12ef701819eb",
                "sessiontype": "breakout 1",
                "title": "Awake and Arise: Centering Faith in and Applying the Atonement of Jesus Christ",
                "demographic": "General",
                "description": "Christ said unto Moses, “I AM THAT I AM” (Exodus 3:14) and to the Jews, “Before Abraham was, I AM” (John 8:58). The phrase, “I am” is the most powerful statement we can make about ourselves. What I am, are you holding? Do you know and feel the truth of who you truly are? We came to this earth to learn and grow and were provided a Savior through which redemption may come. However, there are times that redemptive power seems too abstract or out of reach. In this session we will discuss how to center our faith in Christ and practically apply the Atonement. We will discuss the reality of light and darkness; the truth about the subtle energies in, around, and upon us; how they affect us, and how we can overcome them. We can truly awake and arise out of the dust, shake off our shackles, and live in the love, light, and truth our Savior offers us.",
                "room": "Brighton / Alta",
                "sessiontime": "10:45am - 12:15pm",
                "speakername": "Tonya Cox",
                "speakerbio": "Tonya is married to her high school sweetheart, is a mother, and grandmother. She graduated from BYUI in Marriage and Family Studies and is a Rapid Eye Technician and Life Skills Coach. She assists individuals in treating emotional trauma, releasing limiting beliefs, and damaging family patterns. “We cannot lift anyone onto any higher ground than that upon which we stand. We often experience what we are not, to come to know who we truly are.”",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03154002/Tonya-Cox1.png"
            },
            {
                "id": "18819eb3-12eb-4226-9e57-38b44dbad84f",
                "sessiontype": "breakout 1",
                "title": "Legit Tools for Dealing with Compulsive and Addictive Sexual Behaviors",
                "demographic": "General",
                "description": "This session will focus on practical, emotional, and spiritual tools and principles that have been used by many in preventing and overcoming compulsive pornography use; including other potentially addictive sexual behaviors. We will also explore the impact that these behaviors have on our brains, our self-worth, our relationships with loved ones, and ultimately, our spiritual journey.",
                "room": "Deer Valley",
                "sessiontime": "10:45am - 12:15pm",
                "speakername": "Dan Gray",
                "speakerbio": "Dan is a licensed clinical social worker and Certified Sexual Addiction Therapist (CSAT). He is co-founder of the LifeSTAR Network, a program which provides counseling for individuals and couples dealing with problems related to sexual addictions and compulsive behaviors. Dan has co-authored several books on these subjects, including: Confronting Pornography: A Guide to Prevention and Recovery for Individuals, Loved Ones, and Leaders. He has trained therapists throughout the United States, Eastern Europe, and China.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153955/Dan-Gray.jpg"
            },
            {
                "id": "f968a24d-6124-40e5-886b-3aecf6da8ad5",
                "sessiontype": "breakout 1",
                "title": "Panel: How to Have Hope and Remain Faithful Regardless of Your Transitionary State?",
                "demographic": "Trans",
                "description": "None are exempt from the enduring strength made available through adhering to eternal gospel principles; but finding hope on our journey can be difficult. This panel will discuss how others have been able to hold onto hope regardless of their transitionary state. Learn from others and find hope and healing through your life's journey.",
                "room": "Powder Mtn / Solitude",
                "sessiontime": "10:45am - 12:15pm",
                "speakername": "Brandon Jenson",
                "speakerbio": "Brandon and his wife live in Eagle Mountain with their four children. He is a licensed clinical social worker at Highland Springs Specialty Clinic and Encircle House. He came out five years ago as transgender. They have written an essay for North Star’s Journeys of Faith project and appeared on the Listen, Learn and Love Podcast. Brandon enjoys sharing his story with others as a way to provide hope for others in similar situations.",
                "speakerphoto": "https://s3-us-east-2.amazonaws.com/ns-media-storage/wp-content/uploads/sites/6/2019/03/03153846/Brandon-Jenson.jpg"
            },
            {
                "id": "5c5d50b2-75af-4326-9310-255bb7038da0",
                "sessiontype": "breakout 1",
                "title": "Being the Parent Your Child Needs",
                "demographic": "Family/Friends",
                "description": "Learning to understand the needs of your child and to parent them accordingly is often a complicated journey. In this session, Scott Mackintosh and Preston Jenkins share why being the parent your child needs is so crucial. Scott is the transformed father from The Mackintosh Story, featured on the church’s Mormon and Gay website. Preston is the remarkable missionary that Elder Holland spoke of in the conference talk, “Behold Thy Mother” who returned to the mission field five years after coming home early. You will be inspired by their stories and experiences as you learn to more fully love, support, and meet the needs of your children.",
                "room": "Snowbird",
                "sessiontime": "10:45am - 12:15pm",
                "speakername": "Scott Mackintosh Preston Jenkins",
                "speakerbio": "Scott has a diverse background in sales, concrete construction, and archery hunting in the great outdoors. He has served in countless church callings and is currently the bishop of a young single adult ward. He has put into practice much of what he has learned as a father of a gay son. The Mackintosh Story is a featured video on the Mormon and Gay website.\n\nPreston was born and raised in Las Vegas. He served a mission in Tokyo but returned home early due to injury. After several years of struggling with his sexual identity and his spirituality, he chose to remain a member of the church and finished his mission in Atlanta. Preston's story was shared in Elder Holland's General Conference Address, \"Behold Thy Mother.\" He resides in Provo, attends BYU, and teaches at the MTC.",
                "speakerphoto": ""
            }
        ]
    }
}